recognition-api/app/controllers/api/v1/recognitions_controller.rb

  def index
    @recognitions = Recognition.all
---
SELECT "recognitions".* FROM "recognitions"

  def show
    @recognition = Recognition.find(params[:id])
---
SELECT "recognitions".* FROM "recognitions" WHERE "recognitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @recognition = Recognition.create(note_params)
---
INSERT INTO "recognitions" ("sender", "content", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender", "Wow"], ["content", "Everything, Everything"], ["employee_id", 3], ["created_at", "2020-07-27 04:45:23.769986"], ["updated_at", "2020-07-27 04:45:23.769986"]]